```Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

aws_iam_user.federalist_ecr_read: Refreshing state... [id=federalist-ecr-read]
aws_ecr_repository.federalist_ecr: Refreshing state... [id=federalist/garden-build]
aws_iam_user.federalist_ecr_write: Refreshing state... [id=federalist-ecr-write]
aws_dynamodb_table.terraform_locks: Refreshing state... [id=federalist-terraform-locks]
aws_s3_bucket.terraform_state: Refreshing state... [id=federalist-terraform-state]
aws_iam_access_key.federalist_ecr_write_access_key: Refreshing state... [id=AKIAWNYQRJFGHHGGD57O]
aws_iam_access_key.federalist_ecr_read_access_key: Refreshing state... [id=AKIAWNYQRJFGA2342SG7]
data.aws_iam_policy_document.ecr_read_policy: Refreshing state... [id=678467848]
data.aws_iam_policy_document.ecr_write_policy: Refreshing state... [id=3405643577]
aws_iam_user_policy.federalist_ecr_read: Refreshing state... [id=federalist-ecr-read:federalist-ecr-read]
aws_iam_user_policy.federalist_ecr_write: Refreshing state... [id=federalist-ecr-write:federalist-ecr-write]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_repository.federalist_ecr_recovery will be created
  + resource "aws_ecr_repository" "federalist_ecr_recovery" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "federalist/garden-build"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + federalist_ecr_recovery_url = (known after apply)

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

Releasing state lock. This may take a few moments...
```